# 3 Задайте последовательность чисел. Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности.

list1 = [1, 1, 3, 3, 5, 6, 8, 8, 10, 11, 1, 2, 5, 66, 7, 8, 1, 5, 88]
print(list1)

print(set(list1))